package AIS;

public class Test {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		String[] feature = {"有奶","有毛发","有羽毛","会飞","生蛋",
							"哺乳动物","有爪","有犬齿","目盯前方","食肉动物",
							
							"吃肉","有蹄","有蹄动物","反刍食物","黄褐色",
							"黑色条纹","黑色斑点","长腿","长脖子","暗斑点",
							
							"白色","不会飞","鸟","黑白色","会游泳",
							"善飞","不怕风浪"
		
		};
		String[] goal = {"海燕","老虎","金钱豹","长颈鹿","斑马",
						"鸵鸟","企鹅"
		};
	
		int ruler[][] = {
				{ 5 , 0 },	// 0->5
				{ 5 , 1 },  // 1->5
				{ 22 , 2},  // 2->22
				{ 22 , 3 , 4 }, // 5*6*7*8->9
				{ 9 , 5 , 6 , 7 , 8 }, //5*10->9
				{ 9 , 5 , 10 },  // 5*10->9
				{ 12 , 5 , 11 }, // 5*11->12
				{ 12 , 5 , 13 }, // 5*13->12
				{ 28 , 9 , 14 , 15 },  // 9*14*15->28
				{ 29 , 9 , 14 , 16 },  // 9*14*16->29
				{ 30 , 12 , 17 , 18 , 14 , 19}, // 12*17*18*14*19->30
				{ 31 , 12 , 15 , 20 },  // 12*20*15->31
				{ 32 , 22 , 21 , 17 , 18 , 23 }, // 22*21*17*18*23->32
				{ 33 , 22 , 21 , 24 , 23 }, // 22*21*24*23->33
				{ 27 , 22 , 25 , 26 }  // 22*25*26->27
		};
		AISalgorithm ais = new AISalgorithm(feature, goal, ruler);
		ais.start();
	}

}
